Ohminecraft/ESP32-Attack-Tool/lib/Bad_Usb_Lib/BleKeyboard.cpp
	sendReport(&_mediaKeyReport);
	return 1;
}

size_t BleKeyboard::releaseMouse(const uint16_t b)
{
	buttons(_buttons & ~b);
	return 1;
}

void BleKeyboard::releaseAll(void)
{
	_keyReport.keys[0] = 0;
	_keyReport.keys[1] = 0;
	_keyReport.keys[2] = 0;
	_keyReport.keys[3] = 0;
	_keyReport.keys[4] = 0;
	_keyReport.keys[5] = 0;
	_keyReport.modifiers = 0;
    _mediaKeyReport[0] = 0;
    _mediaKeyReport[1] = 0;
	sendReport(&_keyReport);
	sendReport(&_mediaKeyReport);
}

size_t BleKeyboard::write(uint8_t c)
{
	uint8_t p = press(c);  // Keydown
	release(c);            // Keyup
	return p;              // just return the result of press() since release() almost always returns 1
}

size_t BleKeyboard::write(const MediaKeyReport c)
{
	uint16_t p = press(c);  // Keydown
	release(c);            // Keyup
	return p;              // just return the result of press() since release() almost always returns 1
}

size_t BleKeyboard::write(const uint8_t *buffer, size_t size) {
	size_t n = 0;
	while (size--) {
		if (*buffer != '\r') {
			if (write(*buffer)) {
			  n++;
			} else {
			  break;
			}
		}
		buffer++;
	}
	return n;
}

void BleKeyboard::click(const uint16_t b)
{
	buttons(_buttons | b);
	buttons(_buttons & ~b);
}

void BleKeyboard::move(signed char x, signed char y, signed char wheel, signed char hWheel)
{
	if (this->isConnected())
	{
		uint8_t m[5];
		m[0] = _buttons;
		m[1] = x;
		m[2] = y;
		m[3] = wheel;
		m[4] = hWheel;
		this->inputMouse->setValue(m, 5);
		this->inputMouse->notify();
		this->delay_ms(_delay_ms);
	}
}


void BleKeyboard::wheel(signed char wheel, signed char hWheel)
{
	if (this->isConnected())
	{
		uint8_t m[5];
		m[0] = _buttons;
		m[1] = 0;
		m[2] = 0;
		m[3] = wheel;
		m[4] = hWheel;
		this->inputMouse->setValue(m, 5);
		this->inputMouse->notify();
		this->delay_ms(_delay_ms);
	}
}

void BleKeyboard::buttons(const uint16_t b)
{
	if (b != _buttons)
	{
		_buttons = b;
		move(0, 0, 0, 0);
	}
}

bool BleKeyboard::isPressed(const uint16_t b)
{
	if ((b & _buttons) > 0)
		return true;
	return false;
}

void BleKeyboard::resetButtons() {
	memset(&_buttonsGamepad,0,sizeof(_buttonsGamepad));
	sendReport(&_keyReport);

}
void BleKeyboard::setAxes(int16_t x, int16_t y, int16_t a1, int16_t a2, int16_t a3, int16_t a4, int16_t a5, int16_t a6, signed char hat1, signed char hat2, signed char hat3, signed char hat4) {

 uint8_t m[26]; // 34
    memset(&m,0,sizeof(m));

    memcpy(&m, &_buttonsGamepad, sizeof(_buttonsGamepad));
    m[16] = x;
    m[17] = y;
    m[18] = a1; // z
    m[19] = a2; // rx
    m[20] = a3; // ry
    m[21] = a4; // rz
    m[22] = a5; // slider
    m[23] = a6; // dial
    m[24] = hat1 | (hat2 << 4); // 1 and 2
    m[25] = hat3 | (hat4 << 4); // 3 and 4 
    
    //memset(&m,0, sizeof(m));
    this->inputGamepad->setValue(m, sizeof(m));
    this->inputGamepad->notify();

}
size_t BleKeyboard::pressButton(uint8_t b) {
	char index = (b-1) / 8;
  char bit = (b-1) % 8;
  uint8_t bitmask = (1 << bit);

  uint8_t result = _buttonsGamepad[index] | bitmask;
  if (result != _buttonsGamepad[index]) {
    _buttonsGamepad[index] = result;
  }
 return result;

}
size_t BleKeyboard::releaseButton(uint8_t b) {
 char index = (b-1) / 8;
  char bit = (b-1) % 8;
  uint8_t bitmask = (1 << bit);

  uint64_t result = _buttonsGamepad[index] & ~bitmask;
    _buttonsGamepad[index] = result;
  return result;

}
bool BleKeyboard::isPressedButton(uint8_t b) {
  char index = (b-1) / 8;
  char bit = (b-1) % 8;
  uint8_t bitmask = (1 << bit);

  if ((bitmask & _buttonsGamepad[index]) > 0)
    return true;
  return false;	
}

//void BleKeyboard::onConnect(NimBLEServer *pServer, NimBLEConnInfo& connInfo) {}

void BleKeyboard::onDisconnect(NimBLEServer *pServer, NimBLEConnInfo& connInfo, int reason) {
  this->connected = false;
}

//void BleKeyboard::onWrite(BLECharacteristic* me) {
void BleKeyboard::onWrite(NimBLECharacteristic * me, NimBLEConnInfo & 	connInfo) {
  uint8_t* value = (uint8_t*)(me->getValue().c_str());
  (void)value;
  ESP_LOGI(LOG_TAG, "special keys: %d", *value);
}

void BleKeyboard::delay_ms(uint64_t ms) {
  uint64_t m = esp_timer_get_time();
  if(ms){
    uint64_t e = (m + (ms * 1000));
    if(m > e){ //overflow
        while(esp_timer_get_time() > e) { }
    }
    while(esp_timer_get_time() < e) {}
  }
}
void BleKeyboard::onAuthenticationComplete(NimBLEConnInfo& connInfo) {
    if (connInfo.isEncrypted()) {
        Serial.println("[INFO] Paired successfully.");
        this->connected = true;
    } else {
        Serial.println("[ERROR] Pairing failed");
    }
}

void BleKeyboard::onSubscribe(NimBLECharacteristic *pCharacteristic, NimBLEConnInfo &connInfo, uint16_t subValue ) {
    if (subValue == 0) {
        Serial.println("[INFO] Client unsubscribed from notifications/indications.");
    } else {
        Serial.println("[INFO] Client subscribed to notifications.");
    }
}